## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/62234305/runs/0f8a1fe8-e7ab-4225-973e-cc80b13de9ad).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>


## Dir: flagsmith | Success :thumbsup:
**Dir**: flagsmith
**Workspace**: default
**Success**: :thumbsup:

**Step**: plan
**Success**: :thumbsup:
**Command**: `terraform plan -detailed-exitcode -out /tmp/tmp2dr_n5up/plan`
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # flagsmith_feature.new_homepage_ui will be created
+   resource "flagsmith_feature" "new_homepage_ui" {
+       default_enabled = false
+       description     = "Gradual rollout of redesigned homepage"
+       feature_name    = "new_homepage_ui"
+       id              = (known after apply)
+       initial_value   = (known after apply)
+       is_archived     = (known after apply)
+       project_id      = (known after apply)
+       project_uuid    = "10421b1f-5f29-4da9-abe2-30f88c07c9e8"
+       type            = "MULTIVARIATE"
+       uuid            = (known after apply)
    }

  # flagsmith_mv_feature_option.new_homepage_ui_mv_option will be created
+   resource "flagsmith_mv_feature_option" "new_homepage_ui_mv_option" {
+       default_percentage_allocation = 0
+       feature_id                    = (known after apply)
+       feature_uuid                  = (known after apply)
+       id                            = (known after apply)
+       project_id                    = (known after apply)
+       string_value                  = "option_value_60_percent_of_the_times"
+       type                          = "unicode"
+       uuid                          = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

</details>

## Cost Estimation
**Error calculating Cost Estimation**
<details>
  <summary>Expand for cost estimation details</summary>

```
'NoneType' object is not subscriptable
```
</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
